In [ ]:
# import numpy
import numpy as np

In [2]:
#Importing pandas Library.
import pandas as pd

In [10]:
pip install pandas

Requirement already satisfied: pandas in c:\users\poonam\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\poonam\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\poonam\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\poonam\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\poonam\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\poonam\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [13]:
import numpy as np
import pandas as pd

In [15]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data = d)
ser

a    1
b    2
c    3
dtype: int64

In [17]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'y', 'c'])
ser

a    1.0
y    NaN
c    3.0
dtype: float64

In [20]:
l=['banana', 23]
s = pd.Series(['banana',42], index=['a' , 'b'])
print(s)

a    banana
b        42
dtype: object

In [22]:
s = pd.Series(['Wes Mckinney', 'creator of pandas'],index=['person', 'Who'])
print(s)

person         Wes Mckinney
Who       creator of pandas
dtype: object

In [25]:
# constructing a DataFrame from a Dictionary
scientists = pd.DataFrame({
    'Name': ['Rosaline Franklin', 'William Gosset'],
    'Occupation': ['Chemist', 'Statistician'],
    'Born': ['1920-07-25', '1876-06-13'],
    'Died': ['1958-04-16',   '1937-10-16'],
    'Age': [37,61]})
#Displaying the data frame
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [8]:
# creating DataFrame using a List
productdf = pd.DataFrame([[100, 200, 300, 400], [4, 2, 5, 6]], columns=['pen','shirt','book','mouse',])

#Displaying the data frame.
print(productdf)

   pen  shirt  book  mouse
0  100    200   300    400
1    4      2     5      6

In [30]:
productdf.shape

(2, 4)

In [31]:
productdf.size

8

In [32]:
productdf.keys()

Index(['pen', 'shirt', 'book', 'mouse'], dtype='object')

In [33]:
productdf.columns

Index(['pen', 'shirt', 'book', 'mouse'], dtype='object')

In [9]:
productdf["Mobile"] =[15000,2]
productdf

   pen  shirt  book  mouse  Mobile
0  100    200   300    400   15000
1    4      2     5      6       2

In [35]:
df2 = productdf.drop("Mobile", axis=1)
df2

   pen  shirt  book  mouse
0  100    200   300    400
1    4      2     5      6

In [36]:
df2 = productdf.drop(columns= ["Mobile"])
df2

   pen  shirt  book  mouse
0  100    200   300    400
1    4      2     5      6

In [37]:
df3=df2.drop(index=[0])
df3

   pen  shirt  book  mouse
1    4      2     5      6

In [40]:
productdf2= pd.DataFrame([[15, 16, 17, 18], [5,6,7,8]],columns=['pen', 'shirt', 'book', 'mouse'])
productdf2

   pen  shirt  book  mouse
0   15     16    17     18
1    5      6     7      8

In [10]:
productdf.append(productdf3)

AttributeError: 'DataFrame' object has no attribute 'append'

In [5]:
india_Weather = pd.DataFrame({
"city": ["mumbai","delhi", "banglore"],
"temparature": [32,45,30],
"humidity": [80, 60, 78]
})

india_Weather

       city  temparature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [14]:
humidity_df = pd.DataFrame({
    "city": ["delhi", "mumbai", "banglore"],
    "humidity" : [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [ ]:
df = pd.concat([india_weather, us_weather